app/controllers/admin/pages_controller.rb

SELECT * FROM `pages` ORDER BY title
---
  def index
    @pages = Page.all(:order => 'title')

INSERT INTO `pages` (`page_title`, `updated_at`, `title`, `url`, `form_message`, `description`, `content`, `has_form`, `keywords`, `created_at`) VALUES('test', '2009-08-29 13:29:48', 'test', 'test', '', '', 'test', 0, '', '2009-08-29 13:29:48')
---
  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save

SELECT * FROM `pages` WHERE (`pages`.`url` = 'test') LIMIT 1
---
  def edit
    @page = Page.find_by_url(params[:id])

SELECT `pages`.id FROM `pages` WHERE (`pages`.`url` = BINARY 'test' AND `pages`.id <> 2) LIMIT 1
UPDATE `pages` SET `has_form` = 0, `updated_at` = '2009-08-29 13:35:42' WHERE `id` = 2
---
  def update
    @page = Page.find_by_url(params[:id])
    url = @page.url

    respond_to do |format|
      if @page.update_attributes(params[:page])

SELECT * FROM `pages` WHERE (`pages`.`url` = 'test') LIMIT 1
DELETE FROM `pages` WHERE `id` = 1
---
  def destroy
    @page = Page.find_by_url(params[:id])
    @page.destroy