app/controllers/casenotes_controller.rb

  def all
    @client = Client.find :all
    @casenotes = Casenote.paginate(:page => params[:page], :per_page => 10)
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
SELECT * FROM `casenotes` LIMIT 0, 10
SELECT count(*) AS count_all FROM `casenotes`

  def index
    @client = Client.find(params[:client_id])
    @casenotes = @client.casenotes.paginate
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
SELECT * FROM `casenotes` WHERE (`casenotes`.client_id = 1)

  def show
    @client = Client.find(params[:client_id])
    @casenote = @client.casenotes.find(params[:id])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
SELECT * FROM `casenotes` WHERE (`casenotes`.`id` = 1 AND (`casenotes`.client_id = 1))

  def new
    @client = Client.find(params[:client_id])
    @casenote = @client.casenotes.build
    @user = User.find :all
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
SELECT * FROM `users`

  def edit
    @client = Client.find(params[:client_id])
    @casenote = @client.casenotes.find(params[:id])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
SELECT * FROM `casenotes` WHERE (`casenotes`.`id` = 1 AND (`casenotes`.client_id = 1))

  def create
    @client = Client.find(params[:client_id])
    @casenote = @client.casenotes.build(params[:casenote])
    @user = User.find :all
    respond_to do |format|
      if @casenote.save
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
SELECT * FROM `users`
INSERT INTO `casenotes` (`updated_at`, `client_id`, `note`, `created_at`) VALUES('2009-09-08 11:42:13', 1, 'test', '2009-09-08 11:42:13')

  def update
    @client = Client.find(params[:client_id])
    @casenote = Casenote.find(params[:id])

    respond_to do |format|
      if @casenote.update_attributes(params[:casenote])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
SELECT * FROM `casenotes` WHERE (`casenotes`.`id` = 1)
UPDATE `casenotes` SET `note` = 'this is a test', `updated_at` = '2009-09-09 14:40:32' WHERE `id` = 4

  def destroy
    @client = Client.find(params[:client_id])
    @casenote = Casenote.find(params[:id])
    @casenote.destroy
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
SELECT * FROM `casenotes` WHERE (`casenotes`.`id` = 1)
DELETE FROM `casenotes` WHERE `id` = 1