app/controllers/clients_controller.rb

SELECT * FROM `clients` LIMIT 0, 10
SELECT count(*) AS count_all FROM `clients`
---
  def index
    @clients = Client.paginate(:page => params[:page], :per_page => 10)

SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
---
  def show
    @client = Client.find(params[:id])

SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
---
  def edit
    @client = Client.find(params[:id])

INSERT INTO `clients` (`name`, `updated_at`, `created_at`) VALUES('Bob', '2009-09-07 20:14:56', '2009-09-07 20:14:56')
---
  def create
    @client = Client.new(params[:client])
    if @client.save